Table of Contents
 Class RebarShape
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a geometrical shape for Rebar in 3D space.
[OpenModelClass("CI.StructModel.Structure.RebarShape,CI.StructuralElements", "CI.StructModel.Structure.IRebarShape,CI.BasicTypes")]
public class RebarShape : OpenElementId
Inheritance
object
OpenObject
OpenElementId
RebarShape
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 EndHook
Gets or sets the end rebar hook.
public RebarHookBase EndHook { get; set; }
Property Value
RebarHookBase
 SourceGeometry
Gets or sets the segments of the rebar shape.
public RebarPolyLine3D SourceGeometry { get; set; }
Property Value
RebarPolyLine3D
 StartHook
Gets or sets the start rebar hook.
public RebarHookBase StartHook { get; set; }
Property Value
RebarHookBase
 Edit this page